[
    {
        "id": 1,
        "title": "كتاب التوحيد للمبتدئين",
        "author": "الشيخ فلان",
        "category": "عقيدة",
        "chapters": [
            {
                "id": 1,
                "title": "الباب الأول: أهمية التوحيد",
                "content": "التوحيد هو أساس الدين وأصل الملة، وهو إفراد الله تعالى بالعبادة. أهميته تكمن في أنه أول واجب على المكلف وشرط لصحة الأعمال وقبولها. فالإخلاص هو لب الدين، ولا يقبل الله من العمل إلا ما كان خالصاً لوجهه الكريم. ومقتضى شهادة التوحيد (لا إله إلا الله) هو نفي العبادة عما سوى الله، وإثباتها لله وحده."
            },
            {
                "id": 2,
                "title": "الباب الثاني: أقسام التوحيد",
                "content": "ينقسم التوحيد إلى ثلاثة أقسام رئيسية: 1. **توحيد الربوبية**: وهو إفراد الله بأفعاله كالخلق والرزق والإحياء والإماتة. 2. **توحيد الألوهية (توحيد العبادة)**: وهو إفراد الله بأفعال العباد كالدعاء والصلاة والصوم والنذر. وهو الذي وقع فيه الخلاف بين الأنبياء وأقوامهم. 3. **توحيد الأسماء والصفات**: وهو إثبات ما أثبته الله لنفسه أو أثبته له رسوله من الأسماء والصفات، بلا تحريف ولا تعطيل، ولا تكييف ولا تمثيل."
            },
            {
                "id": 3,
                "title": "الباب الثالث: الشرك وأنواعه",
                "content": "الشرك هو جعل شريك لله في ربوبيته أو ألوهيته أو أسمائه وصفاته، وهو أعظم الذنوب. ينقسم الشرك إلى: **أولاً: الشرك الأكبر**: وهو ما ينافي أصل التوحيد ويوجب الخلود في النار. ومن أمثلته: دعاء غير الله، أو الذبح لغير الله. **ثانياً: الشرك الأصغر**: وهو ما ينافي كمال التوحيد، وهو أكبر من الكبائر. ومن أمثلته: الحلف بغير الله، أو يسير الرياء."
            },
            {
                "id": 4,
                "title": "الباب الرابع: نواقض التوحيد",
                "content": "وهي الأمور التي تفسد التوحيد وتبطله، كالسخرية من الدين، أو اعتقاد أن غير الله يعلم الغيب، أو السحر والكهانة. يجب على طالب العلم أن يتفقه فيها ليحذر من الوقوع فيها."
            }
        ]
    },
    {
        "id": 2,
        "title": "متن الأجرومية",
        "author": "ابن آجروم",
        "category": "لغة عربية",
        "chapters": [
            {
                "id": 5,
                "title": "المقدمة: الكلام وما يتألف منه",
                "content": "الكلام هو: اللفظ المركب، المفيد بالوضع، وأقسامه ثلاثة: **اسم، وفعل، وحرف** جاء لمعنى. فالاسم يُعرف بالخفض والتنوين ودخول الألف واللام وحروف الخفض. والفعل يُعرف بـ (قد، والسين، وسوف، وتاء التأنيث الساكنة). والحرف ما لا يصلح معه علامة الاسم ولا علامة الفعل."
            },
            {
                "id": 6,
                "title": "باب الإعراب",
                "content": "الإعراب هو تغيير أواخر الكلمات لاختلاف العوامل الداخلة عليها لفظاً أو تقديراً. وأقسامه أربعة: **رفع، ونصب، وخفض (جر)، وجزم**. فللأسماء من ذلك الرفع والنصب والخفض ولا جزم فيها، وللأفعال من ذلك الرفع والنصب والجزم ولا خفض فيها."
            },
            {
                "id": 7,
                "title": "باب علامات الإعراب (الرفع)",
                "content": "للرفع أربع علامات: **الضمة، والواو، والألف، والنون**. تكون الضمة علامة للرفع في أربعة مواضع: في الاسم المفرد، وجمع التكسير، وجمع المؤنث السالم، والفعل المضارع الذي لم يتصل بآخره شيء. وتكون الواو في جمع المذكر السالم والأسماء الخمسة، والألف في المثنى، والنون في الأفعال الخمسة."
            },
            {
                "id": 8,
                "title": "باب المنصوبات (المفاعيل)",
                "content": "المنصوبات خمسة عشر، وهي: المفعول به، والمصدر، وظرف الزمان والمكان، والحال، والتمييز، والمستثنى، واسم لا، والمنادى، والمفعول من أجله، والمفعول معه، وخبر كان، واسم إن، والتوابع للمنصوب. وأهمها: **المفاعيل الخمسة** التي يجب دراستها بإتقان."
            }
        ]
    }
]